app/controllers/fir_controller.rb

SELECT "users".* FROM "users"
---
  def first
    @user = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def showdb
    @newdb1 = User.find(params[:id])

INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Meg"], ["age", 333], ["created_at", "2023-01-05 10:20:03.106973"], ["updated_at", "2023-01-05 10:20:03.106973"]]
---
  def create
    @user = User.new(fir_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]
---
  def check
    @user = User.find(68)